# # print("HELLO WORLD")
# # -----------------
# # 01 변수 선언
# # -----------------
# num1 = 10   # 10값을 num1 공간에 초기화
# print(num1) # num1안의 값을 print함수에 전달(화면에 값 출력)
# num1=20     # 20값(Data)을 기존공간num1에 대입
# print(num1) # num1안의 값을 print함수에 전달(화면에 값 출력)
#
# # -----------------
# # 02 변수와 메모리 주소
# # -----------------
# print(id(num1))

# -----------------
# 03 자료형
# -----------------
# a = 10
# b = 2.53
# c = True
# d = 'blue'
# print(a, type(a))
# print(b, type(b))
# print(c, type(c))
# print(d, type(d))


# -----------------
# 04 정수(진수:2진수,8진수,10진수,16진수)
# -----------------
#0b : 뒤에오는 수는 이진테이터(비트열)
# print(0b00000001)
# print(0b00000010)
# print(0b00000011)
# print(0b00000100)

# # 10->2진수 변환
# 10진수				2진수
# 0					      0
# 1					      1
# 2					    10
# 3					    11
# 4					  100
# 5					  101
# 6					  110
# 7					  111
# 8					1000
# 9					1001
#
# # 비트개수 별 10진수범위
# 1bit = 2^1 = 2 	(0~1)
# 2bit = 2^2 = 4	(0~3)
# 3bit = 2^3 = 8	(0~7)
# 4bit = 2^4 = 16	(0~15)
# 5bit = 2^5 = 32	(0~31)
# 6bit = 2^6 = 64	(0~63)
# 7bit = 2^7 = 128 (0~127)
# 8bit = 2^8 = 256 (0~255)
#
# # 8비트 각 자리별 10진수 변환값
# 1 	1	1	1	1	1	1	1
# *	*	*	*	*	*	*	*
# 2^7	2*6	2*5	2*4	2^3	2^2	2^1	2^0
# 128	64	32	16	8	4	2	1 	= 255
#
# 00000000 = 0
# 00000001 = 1
# 00000010 = 2
# 00000011 = 3
# 00000100 = 4
# 00000101 = 5
#
# 00000001 = 1
# 00000011 = 3
# 00000111 = 7
# 00001111 = 15
# 00011111 = 31
# 00111111 = 63
# 01111111 = 127
# 11111111 = 255
#
# 10100101 =
# 11110010 =
# 11001100 =
# 11101110 =
# 01110111 =
# 01011010 =

# # 2진수->10진수
# 10100101 = 128 + 32 + 4 + 1
# 11110010 = 128 + 64 + 32 + 16 + 2
# 11001100 = 128 + 64 + 8 + 4
# 11101110 = 128 + 64 + 32 + 8 + 4 + 2
# 01110111 = 64 + 32 + 16 + 4 + 2 + 1
# 01011010 = 64 + 16 + 8 + 2
#
# # 10진수 -> 2진수
# 19 	-> 00010011
# 88	-> 01011000
# 45	-> 00000000
# 65	-> 00000000
# 97	-> 00000000
# 111	-> 00000000

# print(0o177)
# print(0x0F) #


# -----------------
# 05 실수
# -----------------
# print(3.14)
# print(1.5e-2) #
# print(1.5 + 2.54j)

# -----------------
# 06 논리
# -----------------
# print(type(True), type(False))
# print(bool(0))
# print(bool(-1))
# print(bool(''))
# print(bool('a'))

# -----------------
# 07 문자열
# -----------------
# s1 = 'HELLO\nWORLD'
# s2 = "MY NAME IS"
# s3 = '''
#     동해물과 백두산이
#     마르고 닳도록
# '''
#
# print(s1)
# print(type(s1))


# -----------------
# 07 문자열
# -----------------
# s1 = 'HELLO WORLD'
# print(len(s1) )
# print(s1[-2])
#
# print(s1[0:5])
# print(s1[6:])
# print(s1[:4])
# print(s1[::2])
# print(s1[::-1])


# -----------------
# 08 연결(+) 과 반복(*)
# -----------------
# n1 = 10
# n2 = 20
# s1 = "Python"
# s2 = "Programming"
# print(s1 + " " + s2)
# print(s1 * 3)

# -----------------
# 09 찾기 — find() / index() / in
# -----------------
# s = "Python Programming"
# print(s.find("Pro"))
# print(s.find("Java"))
# print(s.index("Pro"))
# # print(s.index("Java"))
# print("Pro" in s)
# print("Java"in s)

# -----------------
# 10 대/소문자 변환
# -----------------
# s="Python"
# print(s.upper())
# print(s.lower())
# -----------------
# 11 치환
# -----------------
# s = "Python is fun"
# print(s.replace("Python", "Java"))
# s = s.replace("Python", "Java")
# print(s)
# -----------------
# 12 개수 세기 / 나누기
# -----------------
s = "banana"
print(s.count("a"))

csv="apple,banana,cherry"
print(csv.split(",")) # ['apple', 'banana', 'cherry']
arr=csv.split(",")
print("--------------")
print(csv[0])
print(arr[0])






